LearnRails4/Chapter3/sample_app/app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render "edit"
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$N3VGmHPLacoLZl0xBTD4YOwAkYzmfetRAqZpG4D0NN50rqL83y4lq"], ["updated_at", "2016-07-26 09:44:50.172899"], ["id", 762146111]]