LearnRails4/Chapter3/sample_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 599297742]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "FooBar"], ["email", "foo@bar.com"], ["updated_at", "2016-07-25 07:12:57.509275"], ["id", 599297742]]
---
  def update
    @user= User.find(params[:id])
    if @user.update_attributes(user_params)